import pygal
"""Line chart income of south part in 2547"""
def line_chart2547():
    """Show Line chart income of south part in 2547"""
    dic = {
        'ภาคใต้': {
            'นครศรีธรรมราช': {
                2552: 9434,
                2545: 4285,
                2547: 5233,
                2549: 5811,
                2550: 5989
            },
            'ระนอง': {
                2552: 7495,
                2545: 5641,
                2547: 7325,
                2549: 8075,
                2550: 8405
            },
            'พังงา': {
                2552: 8211,
                2545: 5638,
                2547: 7777,
                2549: 9519,
                2550: 9821
            },
            'กระบี่': {
                2552: 6098,
                2545: 5640,
                2547: 8471,
                2549: 9808,
                2550: 11024
            },
            'สตูล': {
                2552: 5419,
                2545: 5523,
                2547: 6294,
                2549: 7240,
                2550: 7417
            },
            'ปัตตานี': {
                2552: 4183,
                2545: 4006,
                2547: 4014,
                2549: 4319,
                2550: 4034
            },
            'ตรัง': {
                2552: 5779,
                2545: 4491,
                2547: 6000,
                2549: 7650,
                2550: 7504
            },
            'พัทลุง': {
                2552: 6317,
                2545: 2274,
                2547: 3170,
                2549: 4164,
                2550: 4270
            },
            'นราธิวาส': {
                2552: 3251,
                2545: 2292,
                2547: 3251,
                2549: 4324,
                2550: 4444
            },
            'ชุมพร': {
                2552: 8318,
                2545: 5279,
                2547: 6652,
                2549: 7665,
                2550: 8617
            },
            'ภูเก็ต': {
                2552: 10873,
                2545: 16912,
                2547: 19294,
                2549: 21373,
                2550: 24727
            },
            'สุราษฎร์ธานี': {
                2552: 8333,
                2545: 5874,
                2547: 8256,
                2549: 10488,
                2550: 10167
            },
            'สงขลา': {
                2552: 8772,
                2545: 6896,
                2547: 8171,
                2549: 9504,
                2550: 9401
            },
            'ยะลา': {
                2552: 5700,
                2545: 3433,
                2547: 4851,
                2549: 6386,
                2550: 6718
        
            }
        }
    }
    height_ = 1000
    width_ = 1000
    html_f_name = '2547_S.html'
    svg_f_name= '2547_S.svg'
    line_chart = pygal.HorizontalBar(height=height_, width=width_)
    line_chart.title = 'สถิติรายได้ของประชากรภาคใต้ในปี 2547'
    for i in dic['ภาคใต้']:
                line_chart.add(i, dic['ภาคใต้'][i][2547])

    html = ("""
    <iframe style="width: 100%%; height: %dpx;" src="/graphs/%s">Error !? iFrame not support in your browser.</iframe>
    """ % (height_, svg_f_name))

    output_file = open(html_f_name, 'w')
    output_file.write(html)
    output_file.close()

    line_chart.render_to_file(svg_f_name)
line_chart2547()

