import pygal
"""Line chart income of north part in 2547"""
def line_chart2547():
    """Show Line chart income of north part in 2547"""
    dic = {
        'ภาคเหนือ': {
            'ลำพูน': {
                2552: 4758,
                2545: 7171,
                2547: 7933,
                2549: 9699,
                2550: 9908
            },
            'กำแพงเพชร': {
                2552: 5346,
                2545: 4503,
                2547: 6149,
                2549: 7514,
                2550: 8006
            },
            'เชียงราย': {
                2552: 5051,
                2545: 2314,
                2547: 2778,
                2549: 3310,
                2550: 3654
            },
            'พิจิตร': {
                2552: 6291,
                2545: 2514,
                2547: 2956,
                2549: 3616,
                2550: 3653
            },
            'เพชรบูรณ์': {
                2552: 6773,
                2545: 2222,
                2547: 2645,
                2549: 3288,
                2550: 3546
            },
            'อุตรดิตถ์': {
                2552: 5934,
                2545: 2490,
                2547: 2897,
                2549: 3620,
                2550: 3591
            },
            'แม่ฮ่องสอน': {
                2552: 2861,
                2545: 1968,
                2547: 2220,
                2549: 2510,
                2550: 2648
            },
            'พะเยา': {
                2552: 4555,
                2545: 2091,
                2547: 2533,
                2549: 3176,
                2550: 3356
            },
            'น่าน': {
                2552: 4285,
                2545: 2136,
                2547: 2427,
                2549: 2760,
                2550: 3043
            },
            'นครสวรรค์': {
                2552: 5528,
                2545: 3121,
                2547: 3938,
                2549: 4776,
                2550: 4826
            },
            'ลำปาง': {
                2552: 5162,
                2545: 3476,
                2547: 3774,
                2549: 4046,
                2550: 4170
            },
            'สุโขทัย': {
                2552: 6686,
                2545: 2212,
                2547: 2641,
                2549: 3000,
                2550: 3178
            },
            'พิษณุโลก': {
                2552: 6491,
                2545: 3585,
                2547: 3930,
                2549: 4703,
                2550: 4952
            },
            'ตาก': {
                2552: 4574,
                2545: 2864,
                2547: 3603,
                2549: 4564,
                2550: 4659
            },
            'แพร่': {
                2552: 6399,
                2545: 2063,
                2547: 2459,
                2549: 2704,
                2550: 2857
            },
            'อุทัยธานี': {
                2552: 5878,
                2545: 2650,
                2547: 3236,
                2549: 3849,
                2550: 4475
            },
            'เชียงใหม่': {
                2552: 5793,
                2545: 4470,
                2547: 5202,
                2549: 6064,
                2550: 6241
            }
        }
    }
    height_ = 1000
    width_ = 1000
    html_f_name = '2547_N.html'
    svg_f_name= '2547_N.svg'
    line_chart = pygal.HorizontalBar(height=height_, width=width_)
    line_chart.title = 'สถิติรายได้ของประชากรภาคเหนือในปี 2547'
    for i in dic['ภาคเหนือ']:
                line_chart.add(i, dic['ภาคเหนือ'][i][2547])

    html = ("""
    <iframe style="width: 100%%; height: %dpx;" src="/graphs/%s">Error !? iFrame not support in your browser.</iframe>
    """ % (height_, svg_f_name))
    
    output_file = open(html_f_name, 'w')
    output_file.write(html)
    output_file.close()

    line_chart.render_to_file(svg_f_name)
line_chart2547()

